import 'package:places/domain/sight.dart';

final List<Sight> mocks = [
  Sight(
    'Мамаев Курган',
    48.742,
    44.539,
    'https://xcourse.me/images/showplaces/707/609e59b44302c77175f2479ee51213ef.jpg',
    'Возвышенность на правом берегу реки Волги в Центральном районе города Волгограда, где во время Сталинградской битвы происходили ожесточённые бои, начиная с сентября 1942 года и заканчивая январём 1943 года. Сегодня Мамаев курган известен в первую очередь памятником-ансамблем «Героям Сталинградской битвы» с главным монументом «Родина-мать зовёт!». ',
    Categories.specialPlace,
  ),
  Sight(
    'Парк ЦПКиО',
    43.986,
    32.592,
    'https://avatars.mds.yandex.net/get-altay/5235198/2a0000017afdeefb6009b7fd234b65744604/XXXL',
    'Хорошее место для прогулок.',
    Categories.park,
  ),
  Sight(
    'Парк ЦПКиО',
    70.986,
    40.592,
    'https://avatars.mds.yandex.net/get-altay/5235198/2a0000017afdeefb6009b7fd234b65744604/XXXL',
    'Хорошее место для прогулок.',
    Categories.park,
  ),
];
