import 'package:places/domain/sight.dart';

final List<Sight> mocks = [
  Sight(
    'Мамаев Курган', 
    48.742, 
    44.539, 
    'https://ru.wikipedia.org/wiki/Мамаев_курган', 
    'Возвышенность на правом берегу реки Волги в Центральном районе города Волгограда, где во время Сталинградской битвы происходили ожесточённые бои, начиная с сентября 1942 года и заканчивая январём 1943 года. Сегодня Мамаев курган известен в первую очередь памятником-ансамблем «Героям Сталинградской битвы» с главным монументом «Родина-мать зовёт!». ',
    'Мемориал',
  ),
  Sight(
    'Парк ЦПКиО',
     43.986, 
     32.592, 
     'https://centralparkvlg.ru/#/', 
     'Хорошее место для прогулок.', 
     'Парк',
  ),
];